{
  "recetas": [
    {
      "nombreReceta": "Fideoss",
      "resenia": "Ríquisima Pasta para un día Fresco!",
      "imagen": "https://images.pexels.com/photos/1279330/pexels-photo-1279330.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "ingredientes": "1Kg de Harina, 3 Huevos, Agua 500cc",
      "descripcion": "Tienes que mezclar todos los ingredientes y despues hacer el fideo.",
      "categoria": "pastas",
      "id": 2
    },
    {
      "nombreReceta": "Chicago Pizza",
      "resenia": "Aprende a preparar esta receta de Chicago Pizza, por Hermanos Petersen en elGourmet",
      "imagen": "https://assets.elgourmet.com/wp-content/uploads/2023/03/chica_T3YimQ5cHVfq8x7KI9MJNzlvreXLBu-1024x683.png.webp",
      "ingredientes": "Aceite de oliva, Agua, Azúcar, Harina, Levadura, Manteca, Harina de maíz, Sal, Muzarella fior di late, Muzarella rallada, Chistorra, Queso provolone, Dientes de ajo, Azúcar, Aji molido, Albahaca, Orégano, Salsa de tomate, Pimienta.",
      "descripcion": "Masa\nEn batidora con gancho amasador colocar agua, azúcar, levadura seca, aceite de oliva, harina de maíz, sal y mezclar.\nAgregar harina y trabajar a baja velocidad hasta integrar y formar un bollo.\nDejar levar por 90 minutos tapado y luego separar en 2 bollos (1 de 400 gramos y 1 de 300 gramos)\nSalsa de tomate\nEn cacerola con aceite de oliva rehogar ajo picado, anchoas, orégano, ají molido y luego de 2 minutos agregar salsa de tomates, sal, pimienta, azúcar y hojas de albahaca.\nDejar espesar a fuego suave por 25 minutos.\nDejar enfriar.\nArmado\nEstirar el bollo grande con palote de un diámetro y forrar un molde pizzero alto (base y paredes dejando que sobre masa ) con aceite de oliva en la base.\nAgregar chistorra en rodajas, muzarella rallada, muzarella fior di latte y provolone rallado.\nEstirar el bollo restante , cubrir el molde uniendo bien los bordes y cubriendo con salsa de tomates.\nRetirar los excesos de masa en los bordes y cocinar en horno a 180° C por 25 minutos.",
      "categoria": "pizza",
      "id": 3
    },
    {
      "nombreReceta": "Ensalada Waldorf",
      "resenia": "Aprende a preparar esta receta de Ensalada Waldorf, por Gonzalo D´Ambrosio en elGourmet",
      "imagen": "https://assets.elgourmet.com/wp-content/uploads/2023/03/ensal_18ioGhnweKIH5bODQCENLzAWgp07rX-1024x683.png.webp",
      "ingredientes": "Apio, Lechuga iceberg, Manzanas granny-smith, Nueces pecanas, Uvas pasas rubias, Sal y pimienta, Jugo De Limón, Aceite de oliva suave,Yema de huevo.",
      "descripcion": "Para comenzar, limpiamos bien la lechuga, reservamos. Luego, limpiamos el apio y cortamos en trocitos finos. Limpiamos las manzanas y cortamos en cubitos.\nLuego, preparamos la mayonesa emulsionando la yema (con la sal y un poco de pimienta) y el jugo de limón y agregando, de a poco y en forma de hilo, el aceite de oliva suave. Con menos de una taza, para una yema grande, será suficiente.\nCondimentamos todos los ingredientes con la mayonesa y presentamos en un plato con la lechuga cortada en trozos. Espolvoreamos con nueces y pasas.\nServimos.\nNota : esta mayonesa está preparada para ser consumida rápidamente. De lo contrario, se sugiere utilizar otro tipo de mayonesa.",
      "categoria": "ensalada",
      "id": 5
    },
    {
      "nombreReceta": "Suprema Maryland",
      "resenia": "Ríquisma suprema para compartir!",
      "imagen": "https://assets.elgourmet.com/wp-content/uploads/2023/03/c54074f8ec1cfaf6dd1ce3e53346d08d_3_3_photo-1024x683.png.webp",
      "ingredientes": "Tomillo, Perejil, Aceite para freir, Huevos, Supremas de pollo, Sal y pimienta, Romero, Harina, Limón.",
      "descripcion": "Elimine la piel de las supremas y salpimente.\nRalle la cáscara del limón.\nBata los huevos con sal, la ralladura de limón, perejil picado, romero picado, tomillo picado.\nPase las supremas por harina, luego por los huevos batidos y a continuación por el panko.\nVuelva a pasa las supremas por el huevo y el panko.\nFría en abundante aceite caliente.\nEscurra sobre papel absorbente",
      "categoria": "carne",
      "id": 6
    },
    {
      "nombreReceta": "Pizza napolitana ",
      "resenia": "Este tipo de pizza ha conquistado el corazón de los porteños. Descubrí qué hay detrás de este fenómeno y 5 lugares en dónde degustarlas.",
      "imagen": "https://elgourmet-assets.s3.amazonaws.com/wp-content/uploads/2023/03/twhe9zl0bn_pizza-1.jpg",
      "ingredientes": "Tomate, Queso, Harina, Agua, Sal, Pimienta, Salsa de Tomate.",
      "descripcion": "Empezaremos nuestra pizza casera por la masa. Para ello, coloca la harina mezclada con la pizca de sal sobre la mesa y haz un hueco en el centro para darle forma de corona.\n\nCoge un bol y vierte el agua junto con el aceite y la levadura. Revuélvelo todo hasta disolver por completo la levadura y vierte la mezcla en el centro de la corona de harina.\n\nIntegra poco a poco los ingredientes hasta obtener una masa homogénea. Amasa durante 7 minutos sobre la mesa, haz una bola con la masa y cúbrela con papel film. Deja que repose durante 20 minutos.\n\nPasado el tiempo, estira la masa con la ayuda de un rodillo y pásala a una bandeja de horno previamente enharinada. Ahora es el momento de rellenarla.\n\n\nExtiende la salsa de tomate sobre la base de la pizza dejando libre un borde de 1 cm. Luego, distribuye la mozzarella rallada por todas partes y hornea la pizza durante 10 minutos a 170ºC. Retírala y cúbrela con tomates cortados en rodajas.\n\nAñade sal al gusto, reparte el ajo y el perejil picados. Incorpora las aceitunas y rocia la pizza casera con un hilo de aceite de oliva. Hornéala durante 5 minutos más. Retira la pizza napolitana y sírvela.",
      "categoria": "pizza",
      "id": 7
    }
  ],
  "usuarios": [
    {
      "id": 1,
      "nombreUsuario": "admin",
      "email": "admin@rollingcode.com",
      "password": "123456eE$"
    }
  ]
}